# "The Game of Money" е игра на случаен принцип, в която трябва да познаете 1 от числата в диапазон от 1 до 4.
# Всяко познато число ви носи два пъти стойността на направения от вас залог, докато при загуба губите стойността
# на залога си.
# След всяко познато число може да се включите в бонус игра с въвеждането на командата "yes". При успех печелите
# последния си залог в четворен размер, докато загубата ви носи отнема троен размер от направения залог от вашия кредит.
# Успех!


import random

print("Добре дошли в играта на парите!\n")
budget = int(input("Моля въведете кредит: "))
choice = [1, 2, 3, 4]
bet = input("Моля определете залога, на който искате да играете или за изход въведете Exit: ")

while budget > 0 and str.upper(bet) != "EXIT":
    current_game = random.choice(choice)
    answer = int(input("Изберете число от 1 до 4: "))

    if answer == current_game:
        budget += int(bet) * 2
        print(f"Честито, вие спечелихте {bet}лв. Остават Ви {budget}лв. кредит.\n "
              f"Ако искате да удвоите залога, въведете 'yes', ако не натиснете произволен клавиш: ")
        guess = input()
        print()
        if guess == "yes":
            current_game = random.choice(choice)
            answer = int(input("Изберете число от 1 до 4: "))
            if answer == current_game:
                budget += int(bet) * 4
                print(f"Честито, Вие удвоихте вашия залог! Остават Ви {budget}лв. кредит. ")
            else:
                budget -= int(bet) * 3
                print(f"Вие загубихте Вашия залог. Верният отговор беше {current_game}."
                      f" Остават Ви {budget}лв. кредит. Моля, опитайте отново!\n")


    else:
        budget -= int(bet)
        print(f"Верният отговор беше {current_game}. Остават Ви {budget}лв. кредит. Моля, опитайте отново!\n")
    bet = input("Моля определете залога, на който искате да играете (за изход въведете exit): ")


else:
    print()
    print("Довиждане! ")
    exit()
